<?php
declare(strict_types=1);

namespace Infrastructure\Symfony\Controller;

use Domain\Direction;
use Symfony\Bundle\FrameworkBundle\Controller\AbstractController;
use Symfony\Component\HttpFoundation\Response;
use Symfony\Component\Routing\Annotation\Route;

#[Route('/', name: 'main_page')]
final class MainPageController extends AbstractController
{


    public function __invoke(): Response
    {
        $services = [
            1 => [
                'img' => 'build/images/1.jpg',
                'img2x' => 'build/images/1@2x.jpg',
                'title' => '🥁 Барабани 🥁',
                'direction' => Direction::Drums->value,
                'desc' => '<h3> Просто та завжди драйвово  </h3>
                <p>Це ваш найкращий антидепресант! Завдяки барабанам, ви зможете краще зрозуміти музику та відкрити для себе, що будь-яка пісня складається з тисячолітніх народних ритмів. </p>  
                <p>🎵 Гра на барабанах - це ідеальний спосіб: </p>
                <ol>    
                    <li>🎓 Вивчити інструмент грати пісні </li>
                    <li>💥 Зняти стрес. Адже де ще можна галасувати та "барабанити" на повну, не дратуючи сусідів? 😉 </li>
                    <li>⚡ "Вдарити" по старим нейронним зв\'язкам та розвивати інтелект. </>
                    <li>✨ "Прибити" рухові розлади та покращити координацію. </li>
                    <li>🧠 Розвивати пам\'ять </li>
                </ol>
                <p>Так що, якщо хочете "барабанити" у житті з новим ритмом, приєднуйтесь до нас! </p>
                                
                ',
            ],
            2 => [
                'img' => 'build/images/2.jpg',
                'img2x' => 'build/images/2@2x.jpg',
                'title' => '🎤 Вокал 🎤',
                'direction' => Direction::Vocal->value,
                'desc' => '<h3>крутезний інструмент для покращення дикції, дихання та подолання страху сцени</h3>

                <p>💬 Вокал - це мозкова йога та антидепресант для тіла, що розв\'язує як соціальні, так і фізичні проблеми</p>
                <p>🎶 Заняття допоможуть у:</p>
                <ol>
                    <li>🔍 Вивченні свого голосу та підкоренні вершин вокального мистецтва</li>
                    <li>🎭 Перетворенні страху сцени на ваш особистий тренд та артистичність</li>
                    <li>🧘‍♀️ Знятті стресу. Бо хто казав, що співати менше кайфово, ніж медитувати?</li>
                    <li>🧩 Будівництві нових нейронних мостів та розвитку інтелекту</li>
                    <li>🗣️ Лікуванні мовних "глюків" і налагодженні комунікації</li>
                    <li>🍫 Отриманні задоволення, адже з нами вокал крутіший за плитку шоколаду (і калорії не зараховуються 😉)</li>
                </ol>
                <p>Отож, якщо хочете насолодитися життям на повну і стати вокальною зіркою, забігайте до нас! 🌟</p>',
            ],
            3 => [
                'img' => 'build/images/3.jpg',
                'img2x' => 'build/images/3@2x.jpg',
                'title' => '🎹 Клавішні 🎹',
                'direction' => Direction::Piano->value,
                'desc' => '
                <h3> інструмент для емоційного та креативного самовираження </h3>
                    
                    <p>😎 Втіліть усі свої душевні переживання та сумніви у фортепіано, перетворивши їх на музичні вібрації!</p>
                    <p>🔥 Фортепіано - клавішний інструмент, на якому можна не тільки відтворювати популярні пісні, а й імпровізувати та створювати свої власні хіти, де можна висловити усі свої радості та печалі. Хто знає, може, настане час, і твій шедевр стане гімном наступного покоління! 😉</p>
                    <p>🚀 Крім того, гра на фортепіано допоможе вам розвинути:</p>
                    <ol>
                        <li>🥁 Відчуття ритму, щоб танцювати під власні композиції</li>
                        <li>🎯 Концентрацію, щоб не втратити ні одного акорду</li>
                        <li>🔈 Смак до стійких звуків, які змусять серця квітнути</li>
                        <li>🎤 Інтонаційні вокальні навички, що дасть змогу заспівати на верхах</li>
                        <li>📝 Майстерність у створенні власних пісень, може, знайдеш новий жанр</li>
                        <li>📚 Покращення знань з теорії музики та сольфеджіо, щоб зрозуміти, що насправді відбувається </li>
                        <li>🎉 Отримання необхідних навичок та насолоду від гри на цьому інструменті - а хто знає, може, це стане твоїм секретним способом розслаблення?</li>
                    </ol>
                    <p>Тож, якщо ви хочете зануритися у світ фортепіано та відкрити в собі нові таланти, ми чекаємо на тебе! З фортепіано твоє життя набуде яскравих кольорів, неповторних мелодій та незабутніх пригод! 🎉 </p>
                ',
            ],
            4 => [
                'img' => 'build/images/4.jpg',
                'img2x' => 'build/images/4@2x.jpg',
                'title' => '🎸 Гітара 🎸 ',
                'direction' => Direction::Guitar->value,
                'desc' => '      
                    <h3> крутий інструмент, який добре звучить як в групі так і сольно </h3>
                    
                   <p> Вона допоможе грати улюблені треки, та просто зробить тебе зіркою на будь-якій вечірці. З гітарою ти зможеш: </p>
        <ol>
            <li>😎 Навчитись грати на неймовірно популярному інструменті, покращуючи пам\'ять, концентрацію та музичний слух. Хто знає, може станеш наступним Джимі Хендриксом?</li>
            <li>🎶 Створювати неймовірні мелодії, поєднуючи ритм, гармонію та свій власний стиль</li>
            <li>🤲 Розвивати дрібну моторику і стати спритним, немов ніндзя</li>
            <li>💡 Розвивати творче мислення та створювати нові музичні шедеври</li>
            <li>🌟 Вивчити різні техніки та прийоми, адже гітара - універсальний інструмент, який використовується в усіх стилях музики - від класики до панк-року</li>
            <li>🧠 Навчитися розподіляти увагу між кількома справами одночасно, тренувати свій мозок, мов суперкомп\'ютер</li>
        </ol>
         <p>🔥 Так що, якщо хочеш стати гітарним супергероєм та підкорити світ своїми мелодіями, приєднуйся до нас та почни свій шлях до слави! 🚀 </p>
                '
            ],
            5 => [
                'img' => 'build/images/5.jpg',
                'img2x' => 'build/images/5@2x.jpg',
                'title' => '🏝️ Укулеле 🏝️',
                'direction' => Direction::Ukulele->value,
                'desc' => '
                <p> інструмент, який додасть трішки гавайського сонця в твоє життя ️☀️</p>
                    <p>З укулеле ти зможеш:</p>
                    <ul>
                      <li>😎 Відчути гавайський дух, граючи на цьому маленькому інструменті, що розвиває пам\'ять та музичний слух.</li>
                      <li>🎵 Створювати прості, але захоплюючі мелодії, які зарядять тебе позитивною енергією.</li>
                      <li>💡 Розвивати творче мислення та імпровізувати власні композиції, навіть якщо ти новачок.</li>
                      <li>🌟 Вивчити основи гри на струнних інструментах, стаючи універсальним музикантом.</li>
                    </ul>
                <p>🚀 То ж приєднуйся до нас, щоб зануритись в океан тропічних мелодій та підкорити світ своїми музичними вібраціями 🌊</p>
                '
            ],
            6 => [
                'img' => 'build/images/6.jpg',
                'img2x' => 'build/images/6@2x.jpg',
                'title' => '🎷 Саксофон 🎷',
                'direction' => Direction::Saxophone->value,
                'desc' => '
                <h3>інструмент, що додає глибину та експресію твоїй музичній майстерності! 🎶</h3>
                <p>Заціни, чого ти можеш навчитись:</p>
                <ul>
                  <li>🌟 Освоєння артикуляції та фразування, що допоможе виразити емоції через музику</li>
                  <li>🎵 Навчитися грати мелодії з різних музичних стилів: джаз, блюз, поп, рок та класика</li>
                  <li>🌬️ Розвиток контролю над диханням та підтримки звуку, що поліпшить твою гру на будь-якому духовому інструменті</li>
                  <li>🔀 Вивчити техніки виконання, які підвищать твою музичну гнучкість та дозволять адаптуватися до різних ситуацій на сцені</li>
                  <li>🧠 Розвивати когнітивні здібності, такі як пам\'ять, концентрацію та координацію, граючи складні музичні партії</li>
                </ul>
                <p>🎉 Не пропусти свій шанс відкрити чарівний світ саксофону - приєднуйся до нас та розвивай свої музичні таланти на новому рівні! 🚀</p>
                ' ],
        ];


        $menu = [
            0 => [
                'url' => '#banner',
                'title' => 'Головна',
            ],
            1 => [
                'url' => '#services',
                'title' => 'Послуги',
            ],
            2 => [
                'url' => '#cost',
                'title' => 'Вартість',
            ],
            3 => [
                'url' => '#reviews',
                'title' => 'Відгуки',
            ],
            4 => [
                'url' => '#contacts',
                'title' => 'Контакти',
            ],
        ];

        $tabs = [
            'Барабани',
            'Вокал',
            'Клавішні',
            'Гітара',
            'Укулеле',
            'Саксофон',
        ];

        $cart = [
            0 => [
                'promo' => '20% OFF',
                'price' => '2 200',
                'promo_price' => '1 800',
                'info' => [
                    '4 заняття (1 раз на тиждень)',
                    'індивідуальний підхід',
                    'тривалість одного заняття 55 хв',
                ],
                'type' => 'Індивідуальні',
                'age' => 'adults',
            ],
            1 => [
                'promo' => '20% OFF',
                'price' => '3 900',
                'promo_price' => '3 200',
                'info' => [
                    '8 занять (2 рази на тиждень)',
                    'індивідуальний підхід',
                    'тривалість одного заняття 55 хв',
                ],
                'type' => 'Індивідуальні',
                'age' => 'adults',
            ],
            2 => [
                'price' => '1 450',
                'info' => [
                    '4 заняття (1 раз на тиждень)',
                    'повний драйв',
                    'злагоджена робота в команді',
                    'тривалість одного заняття 55 хв',
                ],
                'type' => 'Групові',
                'age' => 'adults',
            ],
            3 => [
                'promo' => '20% OFF',
                'price' => '1 500',
                'promo_price' => '1 250',
                'info' => [
                    '4 заняття (1 раз на тиждень)',
                    'індивідуальний підхід',
                    'тривалість одного заняття 35 хв',
                ],
                'type' => 'Індивідуальні',
                'age' => 'children',
            ],
            4 => [
                'promo' => '20% OFF',
                'price' => '2 850',
                'promo_price' => '2 350',
                'info' => [
                    '8 занять (2 рази на тиждень)',
                    'індивідуальний підхід',
                    'тривалість одного заняття 35 хв',
                ],
                'type' => 'Індивідуальні',
                'age' => 'children',
            ],
            5 => [
                'price' => '1 100',
                'info' => [
                    '4 заняття (1 раз на тиждень)',
                    'соціальна активність',
                    'злагоджена робота в команді',
                    'тривалість одного заняття 35 хв',
                ],
                'type' => 'Групові',
                'age' => 'children',
            ],
        ];

        $certificates = [
            1 => [
                'img' => 'build/images/6.jpg',
                'img2x' => 'build/images/6@2x.jpg',
            ],
            2 => [
                'img' => 'build/images/7.jpg',
                'img2x' => 'build/images/7@2x.jpg',
            ],
            3 => [
                'img' => 'build/images/3.jpg',
                'img2x' => 'build/images/3@2x.jpg',
            ],
            4 => [
                'img' => 'build/images/4.jpg',
                'img2x' => 'build/images/4@2x.jpg',
            ],
            5 => [
                'img' => 'build/images/5.jpg',
                'img2x' => 'build/images/5@2x.jpg',
            ],
            6 => [
                'img' => 'build/images/2.jpg',
                'img2x' => 'build/images/2@2x.jpg',
            ],
        ];

        $reviews = [
            ['nickname' => 'Андрій'],
            ['nickname' => '@genkovich'],
            ['nickname' => '@Roan_lite'],
            ['nickname' => '@value'],
            ['nickname' => '@oleg_sanich92'],

        ];


        return $this->render('main/index.html.twig', [
            'menu' => $menu,
            'services' => $services,
            'tabs' => $tabs,
            'cart' => $cart,
            'certificates' => $certificates,
            'reviews' => $reviews,
        ]);
    }

    public function leads(): Response
    {
        dd('ok');
    }


}